<a href="https://colab.research.google.com/github/darshan-jain/19CSE305-ML/blob/main/4_2_EX2_Missing_values.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Finding Missing Values

Reasons for missing Data

* User did not want to fill data due to privacy issues.
* Loss of data while transferring
* Insufficient information to fill a particular column, etc.

There can be multiple reasons for missing values in a dataset

In [1]:
import pandas as pd
dummy_df = pd.read_csv('https://raw.githubusercontent.com/darshan-jain/19CSE305-ML/main/dummy_data.csv')

In [2]:
dummy_df.describe()

            Sno        Age  Height(cm)
count  9.000000   6.000000    7.000000
mean   5.000000  28.166667  154.857143
std    2.738613   2.316607    7.174691
min    1.000000  25.000000  143.000000
25%    3.000000  26.500000  151.000000
50%    5.000000  28.500000  156.000000
75%    7.000000  29.750000  160.000000
max    9.000000  31.000000  163.000000

***Here count returns Non-null values***

In [3]:
len(dummy_df)

9

In [4]:
dummy_df.isna()

     Sno   Name    Age  Height(cm)
0  False  False  False       False
1  False  False  False       False
2  False  False  False       False
3  False  False   True       False
4  False  False   True        True
5  False  False  False       False
6  False  False  False       False
7  False  False  False        True
8  False  False   True       False

In [5]:

dummy_df.notna()

    Sno  Name    Age  Height(cm)
0  True  True   True        True
1  True  True   True        True
2  True  True   True        True
3  True  True  False        True
4  True  True  False       False
5  True  True   True        True
6  True  True   True        True
7  True  True   True       False
8  True  True  False        True

In [6]:
dummy_df.isnull()

     Sno   Name    Age  Height(cm)
0  False  False  False       False
1  False  False  False       False
2  False  False  False       False
3  False  False   True       False
4  False  False   True        True
5  False  False  False       False
6  False  False  False       False
7  False  False  False        True
8  False  False   True       False

## **Finding count of missing values in each column**

In [7]:
dummy_df.isnull().sum()

Sno           0
Name          0
Age           3
Height(cm)    2
dtype: int64

# **Handling Missing Values**

In [8]:
dummy_df

   Sno     Name   Age  Height(cm)
0    1     John  25.0       160.0
1    2    Jimmy  26.0       163.0
2    3  Felicia  28.0       154.0
3    4   Sophia   NaN       143.0
4    5      Bob   NaN         NaN
5    6    Billy  30.0       156.0
6    7     Kate  31.0       160.0
7    8     Will  29.0         NaN
8    9    Scott   NaN       148.0

# **1) Ignoring Missing Data**

### 1.1 Ignoring rows with missing columns

In [9]:
removed_df = dummy_df.dropna()
removed_df

   Sno     Name   Age  Height(cm)
0    1     John  25.0       160.0
1    2    Jimmy  26.0       163.0
2    3  Felicia  28.0       154.0
5    6    Billy  30.0       156.0
6    7     Kate  31.0       160.0

## 1.2) Removing rows with majority columns as missing

In [10]:
dummy_majority_df = pd.read_csv('https://raw.githubusercontent.com/darshan-jain/19CSE305-ML/main/dummy_missing_majority.csv')

In [11]:
dummy_majority_df

   Sno     Name   Age  Height(cm)  Marks(100) Country      City
0    1     John  25.0       160.0        80.0     USA  New York
1    2    Jimmy  26.0       163.0         NaN      UK    London
2    3  Felicia  28.0       154.0         NaN     USA     Miami
3    4   Sophia   NaN       143.0         NaN     NaN       NaN
4    5      Bob   NaN         NaN         NaN     NaN       NaN
5    6    Billy  30.0       156.0         NaN  France     Paris
6    7     Kate  31.0       160.0         NaN   Italy      Rome
7    8     Will  29.0         NaN         NaN  Russia    Moscow
8    9    Scott   NaN       148.0         NaN     NaN       NaN

**thresh=x** attribute tells df.dropna() to keep rows with atleast 'x' Non-Null valuesthresh=x attribute tells df.dropna() to keep rows with atleast 'x' Non-Null values

In [12]:
dummy_majority_df.dropna(thresh=4)

   Sno     Name   Age  Height(cm)  Marks(100) Country      City
0    1     John  25.0       160.0        80.0     USA  New York
1    2    Jimmy  26.0       163.0         NaN      UK    London
2    3  Felicia  28.0       154.0         NaN     USA     Miami
5    6    Billy  30.0       156.0         NaN  France     Paris
6    7     Kate  31.0       160.0         NaN   Italy      Rome
7    8     Will  29.0         NaN         NaN  Russia    Moscow

In [13]:
dummy_majority_df.dropna(thresh=6)

   Sno     Name   Age  Height(cm)  Marks(100) Country      City
0    1     John  25.0       160.0        80.0     USA  New York
1    2    Jimmy  26.0       163.0         NaN      UK    London
2    3  Felicia  28.0       154.0         NaN     USA     Miami
5    6    Billy  30.0       156.0         NaN  France     Paris
6    7     Kate  31.0       160.0         NaN   Italy      Rome

In [14]:
dummy_majority_df.dropna(thresh=7)

   Sno  Name   Age  Height(cm)  Marks(100) Country      City
0    1  John  25.0       160.0        80.0     USA  New York

## 1.3) Dropping columns by percentage of missing values

Drop columns with say over 40% empty values

Note : axis=0 is for rows and axis=1 is for columns

In [15]:
L=len(dummy_majority_df)
print("Length of the dataframe",L)

dummy_majority_df.dropna(axis=1, thresh=int(0.4*L))

Length of the dataframe 9

   Sno     Name   Age  Height(cm) Country      City
0    1     John  25.0       160.0     USA  New York
1    2    Jimmy  26.0       163.0      UK    London
2    3  Felicia  28.0       154.0     USA     Miami
3    4   Sophia   NaN       143.0     NaN       NaN
4    5      Bob   NaN         NaN     NaN       NaN
5    6    Billy  30.0       156.0  France     Paris
6    7     Kate  31.0       160.0   Italy      Rome
7    8     Will  29.0         NaN  Russia    Moscow
8    9    Scott   NaN       148.0     NaN       NaN

## 1.4) Dropping rows with majority columns as null values

Keep rows with atleast 60% of values filled

In [16]:
dummy_majority_df.dropna(axis=0, thresh=int(0.6*len(dummy_majority_df.columns)))

   Sno     Name   Age  Height(cm)  Marks(100) Country      City
0    1     John  25.0       160.0        80.0     USA  New York
1    2    Jimmy  26.0       163.0         NaN      UK    London
2    3  Felicia  28.0       154.0         NaN     USA     Miami
5    6    Billy  30.0       156.0         NaN  France     Paris
6    7     Kate  31.0       160.0         NaN   Italy      Rome
7    8     Will  29.0         NaN         NaN  Russia    Moscow

# **2) Imputation**


### 2.1 Filling with generic values

In [17]:

dummy_df = pd.read_csv('https://raw.githubusercontent.com/darshan-jain/19CSE305-ML/main/dummy_data.csv')
dummy_df

   Sno     Name   Age  Height(cm)
0    1     John  25.0       160.0
1    2    Jimmy  26.0       163.0
2    3  Felicia  28.0       154.0
3    4   Sophia   NaN       143.0
4    5      Bob   NaN         NaN
5    6    Billy  30.0       156.0
6    7     Kate  31.0       160.0
7    8     Will  29.0         NaN
8    9    Scott   NaN       148.0

In [18]:
dummy_df.fillna(-1)

   Sno     Name   Age  Height(cm)
0    1     John  25.0       160.0
1    2    Jimmy  26.0       163.0
2    3  Felicia  28.0       154.0
3    4   Sophia  -1.0       143.0
4    5      Bob  -1.0        -1.0
5    6    Billy  30.0       156.0
6    7     Kate  31.0       160.0
7    8     Will  29.0        -1.0
8    9    Scott  -1.0       148.0

**Note**:changes will be permanently reflected only when inplace=True

In [ ]:
# dummy_df.fillna(inplace=True)

In [19]:
dummy_df.bfill()  #Use the next non-null value to fill

   Sno     Name   Age  Height(cm)
0    1     John  25.0       160.0
1    2    Jimmy  26.0       163.0
2    3  Felicia  28.0       154.0
3    4   Sophia  30.0       143.0
4    5      Bob  30.0       156.0
5    6    Billy  30.0       156.0
6    7     Kate  31.0       160.0
7    8     Will  29.0       148.0
8    9    Scott   NaN       148.0

In [20]:
dummy_df.ffill() #Use the previous non-null value to fill

   Sno     Name   Age  Height(cm)
0    1     John  25.0       160.0
1    2    Jimmy  26.0       163.0
2    3  Felicia  28.0       154.0
3    4   Sophia  28.0       143.0
4    5      Bob  28.0       143.0
5    6    Billy  30.0       156.0
6    7     Kate  31.0       160.0
7    8     Will  29.0       160.0
8    9    Scott  29.0       148.0

### 2.2 Filling with central tendencies

In [21]:
mean_age = dummy_df['Age'].mean()
mean_height = dummy_df['Height(cm)'].mean()

In [22]:
map_dict = {'Age': mean_age, 'Height(cm)': mean_height}
map_dict

{'Age': 28.166666666666668, 'Height(cm)': 154.85714285714286}

In [23]:
dummy_df.fillna(value=map_dict)

   Sno     Name        Age  Height(cm)
0    1     John  25.000000  160.000000
1    2    Jimmy  26.000000  163.000000
2    3  Felicia  28.000000  154.000000
3    4   Sophia  28.166667  143.000000
4    5      Bob  28.166667  154.857143
5    6    Billy  30.000000  156.000000
6    7     Kate  31.000000  160.000000
7    8     Will  29.000000  154.857143
8    9    Scott  28.166667  148.000000